Tekla Open API Reference for Tekla Structures 2025
ControlCircle.LineType Property
 The line type of the control circle.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ControlObjectLineType LineType { get; set; }
Public Property LineType As ControlObjectLineType
	Get
	Set
Property Value
Type: ControlObjectLineType
See Also
Reference
ControlCircle Class
Tekla.Structures.Model Namespace